#+TITLE: Smash
#+AUTHOR: Vegard Sjonfjell og Johan Fjeldtvedt
#+DATE: Fredag 09 Aug 2019
#+OPTIONS: toc:nil

* Meta
Smash

* Tidspunkt
Brygging 2019-08-09

* Ingredienser
#+BEGIN_SRC hy :results none :session bjarne :exports none
  (setv volume 28)
  (setv orig-volume 20.8198)
  (setv boil-time 60)

  (defmacro define-ingredients [coll-name &rest args]
    `(do
       (global ~coll-name)
       (setv ~coll-name ~args)))

  (deftag scale [orig-value] `(* ~orig-value (/ volume orig-volume)))
  (deftag lbs [value] `(* ~value 453.592))
  (deftag oz [value] `(* ~value 28.3495))
  (deftag kg [value] `(* ~value 1000))

  (defn format-time [_ item]
    (if (isinstance (:time item) str)
        (:time item)   
        (.format "{0} min" (:time item))))

  (defn format-grams [_ item]
    (.format "{:.0f} g" (:grams item)))

  (defn get-total [coll key]
    (reduce + (map (fn [item] (get item key)) coll)))

  (defn --percentage [key]
    (fn [coll item]
      (setv total (get-total coll key))
      (.format "{:.2f} %" (* 100 (/ (get item key) total)))))

  (defmacro percentage [key]
    `(--percentage '~key))

  (defn to-table [coll keys]
    (list (map
            (fn [item]
              (list (map (fn [k] (if (keyword? k)
                                    (get item k)
                                    (k coll item)))
                         keys)))
            coll)))

  (defn total-ebc [grains]
    (/ (reduce +
               (map (fn [grain] (* (:grams grain) (:ebc grain)))
                    grains))
       (get-total grains ':grams)))
#+END_SRC
#+BEGIN_SRC hy :results none :session bjarne :exports none
  (define-ingredients grains
    {:grams #scale #lbs 13 :name "Pale malt" :ebc 5})
    
  (define-ingredients hops
    {:time 60  :name "Citra" :grams #scale #oz 0.6}
    {:time 15  :name "Citra" :grams #scale #oz 0.82}
    {:time 0  :name "Citra" :grams #scale #oz 1.25}
    {:time "dryhop" :name "Citra" :grams #scale #oz 2})
    
#+END_SRC

** Malt
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table grains [:name format-grams (percentage :grams)])
#+END_SRC

#+RESULTS:
| Pale malt | 7930 g | 100.00 % |

#+BEGIN_SRC hy :session bjarne :results output table :exports results
(get-total grains ':grams)
#+END_SRC

#+RESULTS:
: 7930.310953995715

#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (total-ebc grains)
#+END_SRC

#+RESULTS:
: 5.0

** Humle
#+BEGIN_SRC hy :session bjarne :results output table :exports results
  (to-table hops [:name format-grams (percentage :grams)])
#+END_SRC
    
#+RESULTS:
| Citra | 23 g | 12.85 % |
| Citra | 31 g | 17.56 % |
| Citra | 48 g | 26.77 % |
| Citra | 76 g | 42.83 % |
    
* Mesking
Mesk i 60 minutter ved gjennomsnittlig 65 grader.
Meskevann 22 L, 18 L skyllevann

* Skylling
TODO Skyllevann
   
* Koking
Kok i 60 minutter.
Humle disponeres i kokeapparat på følgende måte.
   
#+BEGIN_SRC hy :session bjarne :results output table :exports results
      (to-table hops [:name format-time format-grams])
#+END_SRC

#+RESULTS:
| Citra | 60 min | 23 g |
| Citra | 15 min | 31 g |
| Citra | 0 min  | 48 g |
| Citra | dryhop | 76 g |


#+BEGIN_SRC hy :session bjarne :results output table :exports results
(get-total hops ':grams)
#+END_SRC

#+RESULTS:
: 178.05073151519224
   
* Gjæring
To uker på 20 grader
   
* Tapping

